---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarBarType.GetReinforcementRoundingManager
source: html/2f5b170f-bb68-127e-adf7-5d0740e137c1.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType.GetReinforcementRoundingManager Method

Returns an object for managing reinforcement rounding override settings.

## Syntax (C#)
```csharp
public RebarRoundingManager GetReinforcementRoundingManager()
```

## Returns
The rounding manager.